99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_dpp/esp32_mquickjs_wifi_dpp.c
#include "esp32_mquickjs_wifi_dpp.h"
#include "esp32_mquickjs_memory.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_DPP_SUPPORT && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
#include "esp32_mquickjs_wifi_dpp_session.h"
#include "esp32_mquickjs_wifi.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wireless_core.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include <stdio.h>
#include <string.h>

typedef enum { DPP_RECEIVE, DPP_CLOSE, DPP_CONNECT } dpp_operation_t;
typedef struct {
    esp32_mquickjs_wifi_dpp_worker_options_t config;
    uint32_t timeout_ms;
    bool allow_ap_channel_change;
} dpp_options_t;
struct esp32_mquickjs_future_driver_state {
    esp32_mquickjs_wifi_dpp_session_t *session;
    dpp_operation_t operation;
    uint32_t timeout_ms;
    int64_t deadline_us;
    unsigned configuration_index;
    esp32_mquickjs_wifi_dpp_auth_t authentication;
    bool started, cancelled, wait_timed_out, observation_registered, allow_ap_restart;
};
#define SET(object, name, value) do { if (!esp32_mquickjs_set_property_ref(ctx, object, name, value)) goto fail; } while (0)

/* Copies exactly one validated UTF-8 string. No JS allocation occurs while the
 * temporary C-string pointer is live; diagnostics never contain its contents. */
static bool dpp_string(JSContext *ctx, JSValue value, char *out, size_t capacity)
{
    if (!JS_IsString(ctx, value)) return false;
    JSCStringBuf buffer;
    size_t length = 0;
    const char *text = JS_ToCStringLen(ctx, &length, value, &buffer);
    if (!text || length >= capacity || memchr(text, 0, length)) return false;
    memcpy(out, text, length); out[length] = 0;
    return true;
}

static bool dpp_options(JSContext *ctx, JSGCRef *root, dpp_options_t *options)
{
    static const char *const keys[] = {"channels", "privateKeyHexDer", "info", "timeoutMs", "allowApChannelChange"};
    *options = (dpp_options_t){.config = {.channels = "6"}, .timeout_ms = 120000};
    JSGCRef field_ref, list_ref;
    JSValue *field = JS_PushGCRef(ctx, &field_ref), *list = JS_PushGCRef(ctx, &list_ref);
    bool ok = false;
    if (!esp32_mquickjs_validate_plain_options(ctx, root->val, "wifi.dpp.startEnrollee", keys, 5)) goto done;
#define FIELD(name) do { *field = JS_GetPropertyStr(ctx, root->val, name); if (JS_IsException(*field)) goto done; } while (0)
    FIELD("channels"); *list = *field;
    if (!JS_IsUndefined(*list)) {
        if (!JS_IsArray(ctx, *list)) goto invalid;
        *field = JS_GetPropertyStr(ctx, *list, "length");
        uint32_t count;
        if (JS_IsException(*field)) goto done;
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, ESP_DPP_MAX_CHAN_COUNT, &count)) goto invalid;
        size_t used = 0;
        uint8_t channels[ESP_DPP_MAX_CHAN_COUNT] = {0};
        for (uint32_t i = 0; i < count; ++i) {
            *field = JS_GetPropertyUint32(ctx, *list, i);
            uint32_t channel;
            if (JS_IsException(*field)) goto done;
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 255, &channel)) goto invalid;
            for (uint32_t j = 0; j < i; ++j) if (channels[j] == channel) goto invalid;
            channels[i] = (uint8_t)channel;
            int n = snprintf(options->config.channels + used, sizeof(options->config.channels) - used,
                "%s%u", i ? "," : "", (unsigned)channel);
            if (n < 0 || (size_t)n >= sizeof(options->config.channels) - used) goto invalid;
            used += (size_t)n;
        }
    }
    FIELD("privateKeyHexDer");
    if (!JS_IsUndefined(*field)) {
        if (!dpp_string(ctx, *field, options->config.private_key_hex_der, sizeof(options->config.private_key_hex_der))) goto invalid;
        options->config.has_key = true;
    }
    FIELD("info");
    if (!JS_IsUndefined(*field)) {
        if (!dpp_string(ctx, *field, options->config.info, sizeof(options->config.info))) goto invalid;
        options->config.has_info = true;
    }
    FIELD("timeoutMs");
    if (!JS_IsUndefined(*field) && !esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 3600000, &options->timeout_ms)) goto invalid;
    FIELD("allowApChannelChange");
    if (!JS_IsUndefined(*field)) {
        if (!JS_IsBool(*field)) goto invalid;
        options->allow_ap_channel_change = *field == JS_TRUE;
    }
    if (esp32_mquickjs_wifi_dpp_worker_validate(&options->config) != ESP_OK) goto invalid;
    ok = true; goto done;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid DPP options");
done:
    if (!ok) esp32_mquickjs_wireless_secure_zero(options, sizeof(*options));
    JS_PopGCRef(ctx, &list_ref); JS_PopGCRef(ctx, &field_ref); return ok;
#undef FIELD
}

static esp32_mquickjs_wifi_dpp_session_t *dpp_receiver(JSContext *ctx, JSValue value)
{
    if (JS_GetClassID(ctx, value) != JS_CLASS_WIFI_DPP_SESSION) {
        JS_ThrowTypeError(ctx, "expected WiFiDppSession"); return NULL;
    }
    esp32_mquickjs_wifi_dpp_session_t *session = JS_GetOpaque(ctx, value);
    if (!session) JS_ThrowReferenceError(ctx, "invalid WiFiDppSession");
    return session;
}
void js_wifi_dpp_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    /* Pending Future references keep the session alive. The registry requests
     * close when the final external reference, including those Futures, drops. */
    esp32_mquickjs_wifi_dpp_session_release(opaque);
}
JSValue js_wifi_dpp_constructor(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argc; (void)argv;
    return JS_ThrowTypeError(ctx, "use wifi.dpp.startEnrollee()");
}
static JSValue dpp_identity(JSContext *ctx, uint64_t identity)
{
    if (!identity) return JS_NULL;
    JSGCRef ref;
    JSValue *value = JS_PushGCRef(ctx, &ref);
    *value = JS_NewObject(ctx);
    if (JS_IsException(*value)) goto fail;
    SET(value, "low", JS_NewUint32(ctx, (uint32_t)identity));
    SET(value, "high", JS_NewUint32(ctx, (uint32_t)(identity >> 32)));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
static JSValue dpp_status_to_js(JSContext *ctx, const esp32_mquickjs_wifi_dpp_session_status_t *s)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "state", JS_NewString(ctx, s->closing ? s->retired ? "closed" : "closing" :
        s->error ? "faulted" : s->connected ? "connected" : s->connection_requested ? "connecting" :
        s->configs_consumed ? "consumed" : s->configs_ready ? "configurations-ready" :
        s->uri_ready ? "uri-ready" : s->listening ? "negotiating" : "opening"));
    SET(result, "operation", s->native.operation.identity ? JS_NewUint32(ctx, s->native.operation.identity) : JS_NULL);
    SET(result, "radioGeneration", s->native.operation.identity ? JS_NewUint32(ctx, s->native.operation.generation) : JS_NULL);
    SET(result, "nativeIdentity", dpp_identity(ctx, s->native.worker.native.identity));
    SET(result, "workerBusy", JS_NewBool(s->worker_busy));
    SET(result, "connectionRequested", JS_NewBool(s->connection_requested));
    SET(result, "connectionPrepared", JS_NewBool(s->connection_prepared));
    SET(result, "connectionVerified", JS_NewBool(s->connection_verified));
    SET(result, "connected", JS_NewBool(s->connected));
    SET(result, "configurationIndex", s->connection_requested ? JS_NewUint32(ctx, s->configuration_index) : JS_NULL);
    SET(result, "authentication", s->connection_requested ? JS_NewString(ctx,
        s->authentication == ESP32_MQUICKJS_DPP_AUTH_CONNECTOR ? "dpp" :
        s->authentication == ESP32_MQUICKJS_DPP_AUTH_SAE ? "wpa3-sae" : "wpa2-psk") : JS_NULL);
    SET(result, "connectionGeneration", s->connection_generation ? JS_NewUint32(ctx, s->connection_generation) : JS_NULL);
    SET(result, "connectionReason", s->connection_reason ? JS_NewInt32(ctx, s->connection_reason) : JS_NULL);
    SET(result, "stationConfigRestored", JS_NewBool(s->native.config_restored));
    SET(result, "storageRestored", JS_NewBool(s->native.storage_restored));
    SET(result, "restoreRequiresRestart", JS_NewBool(s->native.restore_requires_restart));
    SET(result, "restoreStopped", JS_NewBool(s->native.restore_stopped));
    SET(result, "restoreStarted", JS_NewBool(s->native.restore_started));
    SET(result, "restoreStartFailed", JS_NewBool(s->native.restore_start_failed));
    SET(result, "restoreStartError", s->native.restore_start_error ? JS_NewInt32(ctx, s->native.restore_start_error) : JS_NULL);
    SET(result, "recoveryPending", JS_NewBool(s->recovery_pending));
    SET(result, "recoveryAttempts", JS_NewUint32(ctx, s->native.restore_recovery_attempts));
    SET(result, "listening", JS_NewBool(s->listening));
    SET(result, "uriReady", JS_NewBool(s->uri_ready && !s->closing && !s->uri_consumed));
    SET(result, "uriConsumed", JS_NewBool(s->uri_consumed));
    SET(result, "configurationsReady", JS_NewBool(s->configs_ready && !s->closing && !s->configs_consumed));
    SET(result, "configurationsConsumed", JS_NewBool(s->configs_consumed));
    SET(result, "captureFinished", JS_NewBool(s->capture_finished));
    SET(result, "nativeClosed", JS_NewBool(s->native_closed));
    SET(result, "helperDrained", JS_NewBool(s->helper_drained));
    SET(result, "channelRestored", JS_NewBool(s->native.channel_restored));
    SET(result, "eventFenced", JS_NewBool(s->native.worker.native.event_fenced));
    SET(result, "closeRequested", JS_NewBool(s->closing));
    SET(result, "cleanupPending", JS_NewBool(s->closing && !s->retired));
    SET(result, "timedOut", JS_NewBool(s->timed_out));
    SET(result, "handoffUnknown", JS_NewBool(s->native.worker.handoff_unknown));
    SET(result, "terminalSeen", JS_NewBool(s->native.worker.native.terminal));
    SET(result, "configurationCount", JS_NewUint32(ctx, s->config_count));
    SET(result, "reservedBytes", JS_NewUint32(ctx, s->reserved_bytes));
    SET(result, "observationDrops", JS_NewUint32(ctx, s->native.worker.native.observation_drops));
    SET(result, "asyncPending", JS_NewUint32(ctx, s->native.worker.native.async_pending));
    SET(result, "asyncActive", JS_NewUint32(ctx, s->native.worker.native.async_active));
    SET(result, "txWakeRetries", JS_NewUint32(ctx, s->native.worker.native.tx_wake_retries));
    SET(result, "txQueuedBytes", JS_NewUint32(ctx, s->native.worker.native.tx_queued_bytes));
    SET(result, "txBufferPresent", JS_NewBool(s->native.worker.native.tx_buffer_present));
    SET(result, "txRecycling", JS_NewBool(s->native.worker.native.tx_recycling));
    SET(result, "txRecycled", JS_NewBool(s->native.worker.native.tx_recycled));
    SET(result, "txQueued", JS_NewBool(s->native.worker.native.tx_queued));
    SET(result, "error", s->error ? JS_NewInt32(ctx, s->error) : JS_NULL);
    SET(result, "cleanupError", s->cleanup_error ? JS_NewInt32(ctx, s->cleanup_error) : JS_NULL);
    SET(result, "txError", s->native.worker.native.tx_error ? JS_NewInt32(ctx, s->native.worker.native.tx_error) : JS_NULL);
    SET(result, "txBufferError", s->native.worker.native.tx_buffer_error ? JS_NewInt32(ctx, s->native.worker.native.tx_buffer_error) : JS_NULL);
    SET(result, "txPostError", s->native.worker.native.tx_post_error ? JS_NewInt32(ctx, s->native.worker.native.tx_post_error) : JS_NULL);
    SET(result, "channelTimerError", s->native.worker.native.chm_error ? JS_NewInt32(ctx, s->native.worker.native.chm_error) : JS_NULL);
    SET(result, "stage", s->stage ? JS_NewString(ctx, s->stage) : JS_NULL);
    SET(result, "cleanupStage", s->cleanup_stage ? JS_NewString(ctx, s->cleanup_stage) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
#define DPP_WATCH_HANDLES 4U
#define DPP_WATCH_CAPACITY 16U
typedef struct {
    uint32_t sequence;
    esp32_mquickjs_wifi_dpp_session_status_t status;
} dpp_watch_event_t;
