99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_dpp/esp32_mquickjs_wifi_dpp.c
typedef struct {
    esp32_mquickjs_event_queue_t *queue;
    esp32_mquickjs_wifi_dpp_session_t *session;
    dpp_watch_event_t last;
    bool context_bound;
} dpp_watch_source_t;
static portMUX_TYPE s_dpp_watch_lock = portMUX_INITIALIZER_UNLOCKED;
static dpp_watch_source_t *s_dpp_watch_sources[DPP_WATCH_HANDLES];
static unsigned s_dpp_watch_handles;

/* Compare semantic fields, never padding or the transient worker-busy bit.
 * Every queued pointer is a framework stage string with static lifetime. */
static bool dpp_watch_same(const esp32_mquickjs_wifi_dpp_session_status_t *a,
    const esp32_mquickjs_wifi_dpp_session_status_t *b)
{
#define SAME(field) if (a->field != b->field) return false
    SAME(error);
    SAME(cleanup_error);
    SAME(stage);
    SAME(cleanup_stage);
    SAME(uri_ready);
    SAME(uri_consumed);
    SAME(configs_ready);
    SAME(configs_consumed);
    SAME(config_count);
    SAME(closing);
    SAME(retired);
    SAME(timed_out);
    SAME(capture_finished);
    SAME(native_closed);
    SAME(helper_drained);
    SAME(listening);
    SAME(connection_requested);
    SAME(connection_prepared);
    SAME(connection_verified);
    SAME(connected);
    SAME(configuration_index);
    SAME(connection_generation);
    SAME(connection_reason);
    SAME(authentication);
    SAME(native.config_restored);
    SAME(native.storage_restored);
    SAME(native.restore_requires_restart);
    SAME(native.restore_stopped);
    SAME(native.restore_started);
    SAME(native.restore_start_failed);
    SAME(native.restore_start_error);
    SAME(native.restore_recovery_attempts);
    SAME(recovery_pending);
    SAME(native.operation.identity);
    SAME(native.operation.generation);
    SAME(native.worker.native.identity);
    SAME(native.worker.handoff_unknown);
    SAME(native.channel_restored);
    SAME(native.worker.native.event_fenced);
    SAME(native.worker.native.terminal);
    SAME(native.worker.native.tx_error);
    SAME(native.worker.native.tx_buffer_error);
    SAME(native.worker.native.tx_post_error);
    SAME(native.worker.native.chm_error);
    SAME(native.worker.native.tx_buffer_present);
    SAME(native.worker.native.tx_recycling);
    SAME(native.worker.native.tx_recycled);
    SAME(native.worker.native.tx_queued);
#undef SAME
    return true;
}

static void dpp_watch_closed(void *opaque)
{
    dpp_watch_source_t *source = opaque;
    portENTER_CRITICAL(&s_dpp_watch_lock);
    for (unsigned i = 0; i < DPP_WATCH_HANDLES; ++i)
        if (s_dpp_watch_sources[i] == source) s_dpp_watch_sources[i] = NULL;
    esp32_mquickjs_wifi_dpp_session_t *session = source->session;
    source->session = NULL;
    bool bound = source->context_bound;
    if (!bound) --s_dpp_watch_handles;
    portEXIT_CRITICAL(&s_dpp_watch_lock);
    if (session) esp32_mquickjs_wifi_dpp_session_release(session);
    /* Only a private queue construction failure uses this path. No receiver
     * or producer has seen it; its deferred close owns the failed context. */
    if (!bound) esp32_mquickjs_memory_payload_free(source);
}

static void dpp_watch_destroyed(void *opaque)
{
    portENTER_CRITICAL(&s_dpp_watch_lock);
    --s_dpp_watch_handles;
    portEXIT_CRITICAL(&s_dpp_watch_lock);
    esp32_mquickjs_memory_payload_free(opaque); /* Budget survives close until queue storage dies. */
}

static JSValue dpp_watch_to_js(JSContext *ctx, const void *data, void *opaque)
{
    (void)opaque;
    const dpp_watch_event_t *event = data;
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "sequence", JS_NewUint32(ctx, event->sequence));
    SET(result, "status", dpp_status_to_js(ctx, &event->status));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

bool esp32_mquickjs_wifi_dpp_poll_observations(bool close)
{
    bool handled = false;
    for (unsigned i = 0; i < DPP_WATCH_HANDLES; ++i) {
        esp32_mquickjs_event_queue_t *queue = NULL;
        esp32_mquickjs_wifi_dpp_session_t *session = NULL, *detached = NULL;
        portENTER_CRITICAL(&s_dpp_watch_lock);
        dpp_watch_source_t *source = s_dpp_watch_sources[i];
        if (source && esp32_mquickjs_event_queue_retain(source->queue)) {
            queue = source->queue;
            if (!close && esp32_mquickjs_wifi_dpp_session_retain(source->session)) session = source->session;
        } else if (source && close) {
            /* A disposed queue already belongs to its reaper. Detach now;
             * its later close callback sees NULL and cannot double-release. */
            s_dpp_watch_sources[i] = NULL;
            detached = source->session; source->session = NULL;
        }
        portEXIT_CRITICAL(&s_dpp_watch_lock);
        if (detached) esp32_mquickjs_wifi_dpp_session_release(detached);
        if (!queue) continue;
        if (close) {
            handled = esp32_mquickjs_event_queue_close(queue) || handled;
        } else if (session) {
            dpp_watch_event_t event = {0};
            if (esp32_mquickjs_wifi_dpp_session_observation(session, &event.status) &&
                (!source->last.sequence || !dpp_watch_same(&source->last.status, &event.status))) {
                if (source->last.sequence == UINT32_MAX) esp32_mquickjs_event_queue_request_close(queue);
                else {
                    event.sequence = source->last.sequence + 1U;
                    source->last = event; /* Drop-newest never retries an old snapshot. */
                    (void)esp32_mquickjs_event_queue_try_send_from_callback(queue, &event);
                    handled = true;
                }
            }
            esp32_mquickjs_wifi_dpp_session_release(session);
        }
        esp32_mquickjs_event_queue_release(queue);
    }
    return handled;
}

JSValue js_wifi_dpp_watch(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    esp32_mquickjs_wifi_dpp_session_t *session = dpp_receiver(ctx, *self);
    if (!session) return JS_EXCEPTION;
    if (!esp32_mquickjs_wifi_dpp_session_retain(session))
        return JS_ThrowInternalError(ctx, "Dpp reference exhausted");
    JSGCRef options_ref, field_ref, queue_ref;
    JSValue *options = JS_PushGCRef(ctx, &options_ref), *field = JS_PushGCRef(ctx, &field_ref);
    JSValue *queue = JS_PushGCRef(ctx, &queue_ref);
    uint32_t capacity = 8;
    if (argc > 1) goto invalid;
    *options = argc ? argv[0] : JS_UNDEFINED;
    if (!JS_IsUndefined(*options)) {
        static const char *const keys[] = {"capacity"};
        if (!esp32_mquickjs_validate_plain_options(ctx, *options, "WiFiDppSession.watch", keys, 1)) goto fail;
        *field = JS_GetPropertyStr(ctx, *options, "capacity");
        if (JS_IsException(*field)) goto fail;
        if (!JS_IsUndefined(*field) && !esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, DPP_WATCH_CAPACITY, &capacity)) goto invalid;
    }
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    if (!runtime) { JS_ThrowInternalError(ctx, "Dpp watch requires an active runtime"); goto fail; }
    dpp_watch_source_t *source = esp32_mquickjs_memory_wireless_calloc("wifi", 1, sizeof(*source), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (!source) { JS_ThrowOutOfMemory(ctx); goto fail; }
    unsigned slot = DPP_WATCH_HANDLES;
    bool duplicate = false;
    portENTER_CRITICAL(&s_dpp_watch_lock);
    for (unsigned i = 0; i < DPP_WATCH_HANDLES; ++i) {
        if (!s_dpp_watch_sources[i]) slot = i;
        else if (s_dpp_watch_sources[i]->session == session) duplicate = true;
    }
    bool available = !duplicate && slot != DPP_WATCH_HANDLES && s_dpp_watch_handles < DPP_WATCH_HANDLES;
    if (available) ++s_dpp_watch_handles;
    portEXIT_CRITICAL(&s_dpp_watch_lock);
    if (!available) {
        esp32_mquickjs_memory_payload_free(source); JS_ThrowInternalError(ctx, "Dpp watch already open or queue budget retained"); goto fail;
    }
    source->session = session; session = NULL; /* Context owns the retained reference. */
    *queue = esp32_mquickjs_event_queue_new_wireless("wifi", ctx, runtime, sizeof(dpp_watch_event_t), capacity,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST, dpp_watch_to_js, NULL, dpp_watch_closed, source);
    if (JS_IsException(*queue)) { dpp_watch_closed(source); goto fail; }
    source->queue = esp32_mquickjs_event_queue_from_value(ctx, *queue);
    source->context_bound = esp32_mquickjs_event_queue_bind_context_release(source->queue, dpp_watch_destroyed);
    if (!source->context_bound) {
        /* Dispose owns deferred close; do not free its opaque context here. */
        (void)esp32_mquickjs_event_queue_dispose(ctx, *queue);
        JS_ThrowInternalError(ctx, "Dpp queue lifetime binding failed"); goto fail;
    }
    portENTER_CRITICAL(&s_dpp_watch_lock);
    s_dpp_watch_sources[slot] = source;
    portEXIT_CRITICAL(&s_dpp_watch_lock);
    JSValue result = JS_PopGCRef(ctx, &queue_ref);
    JS_PopGCRef(ctx, &field_ref); JS_PopGCRef(ctx, &options_ref);
    return result;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "Dpp watch capacity must be an integer in 1..16");
fail:
    if (session) esp32_mquickjs_wifi_dpp_session_release(session);
    JS_PopGCRef(ctx, &queue_ref); JS_PopGCRef(ctx, &field_ref); JS_PopGCRef(ctx, &options_ref);
    return JS_EXCEPTION;
}

