99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_dpp/esp32_mquickjs_wifi_dpp.c
static JSValue dpp_error(JSContext *ctx, const char *operation, esp32_mquickjs_wifi_dpp_session_t *session,
    esp_err_t error, bool wait_timeout)
{
    esp32_mquickjs_wifi_dpp_session_status_t status = {0};
    if (session) (void)esp32_mquickjs_wifi_dpp_session_status(session, &status);
    if (error == ESP_OK) error = status.error ? status.error : ESP_ERR_INVALID_STATE;
    bool timeout = wait_timeout || status.timed_out || error == ESP_ERR_TIMEOUT;
    JSGCRef ref;
    JSValue *details = JS_PushGCRef(ctx, &ref);
    *details = dpp_status_to_js(ctx, &status);
    if (JS_IsException(*details)) goto fail;
    SET(details, "espCode", JS_NewInt32(ctx, error));
    SET(details, "espName", JS_NewString(ctx, esp_err_to_name(error)));
    SET(details, "waitTimedOut", JS_NewBool(wait_timeout));
    (void)esp32_mquickjs_throw_native_error(ctx, timeout ? "WIFI_DPP_TIMEOUT" :
        status.closing && status.error == ESP_OK ? "WIFI_DPP_CLOSED" : "WIFI_DPP_FAILED",
        operation, "Dpp operation did not complete; inspect session status", *details);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
JSValue js_wifi_dpp_status(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "Dpp status expects no arguments");
    esp32_mquickjs_wifi_dpp_session_t *session = dpp_receiver(ctx, *self);
    if (!session) return JS_EXCEPTION;
    esp32_mquickjs_wifi_dpp_session_status_t status;
    (void)esp32_mquickjs_wifi_dpp_session_status(session, &status);
    return dpp_status_to_js(ctx, &status);
}
JSValue js_wifi_dpp_global_status(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "Dpp status expects no arguments");
    esp32_mquickjs_wifi_dpp_global_status_t status;
    esp32_mquickjs_wifi_dpp_global_status(&status);
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "active", JS_NewBool(status.active));
    SET(result, "handles", JS_NewUint32(ctx, status.handles));
    SET(result, "workers", JS_NewUint32(ctx, status.workers));
    SET(result, "runtimeClosing", JS_NewBool(status.runtime_closing));
    SET(result, "session", status.active ? dpp_status_to_js(ctx, &status.session) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
JSValue js_wifi_dpp_capabilities(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "Dpp capabilities expects no arguments");
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "apiVersion", JS_NewString(ctx, "wifi-dpp/1"));
    SET(result, "stability", JS_NewString(ctx, "candidate"));
    SET(result, "enrollee", JS_TRUE);
    SET(result, "qrCode", JS_TRUE);
    SET(result, "autoConnect", JS_FALSE);
    SET(result, "configurationSelection", JS_TRUE);
    SET(result, "connectorAuthentication", JS_TRUE);
    SET(result, "pskAuthentication", JS_TRUE);
    #if CONFIG_ESP_WIFI_ENABLE_WPA3_SAE
    SET(result, "saeAuthentication", JS_TRUE);
#else
    SET(result, "saeAuthentication", JS_FALSE);
#endif
    SET(result, "connectionOwnership", JS_NewString(ctx, "session"));
    SET(result, "observations", JS_TRUE);
    SET(result, "maxChannels", JS_NewInt32(ctx, ESP_DPP_MAX_CHAN_COUNT));
    SET(result, "maxConfigurations", JS_NewInt32(ctx, ESP_DPP_MAX_CONFIG_COUNT));
    SET(result, "maxSessions", JS_NewInt32(ctx, ESP32_MQUICKJS_DPP_MAX_HANDLES));
    SET(result, "maxActiveSessions", JS_NewInt32(ctx, 1));
    SET(result, "maxWatchQueues", JS_NewInt32(ctx, DPP_WATCH_HANDLES));
    SET(result, "maxWatchCapacity", JS_NewInt32(ctx, DPP_WATCH_CAPACITY));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
JSValue js_wifi_dpp_start(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.dpp.startEnrollee expects options");
    JSGCRef options_ref, result_ref;
    JSValue *input = JS_PushGCRef(ctx, &options_ref), *result = JS_PushGCRef(ctx, &result_ref);
    *input = argv[0];
    dpp_options_t options;
    esp32_mquickjs_wifi_dpp_session_t *session = NULL;
    if (!dpp_options(ctx, &options_ref, &options)) goto fail;
    esp_err_t error = esp32_mquickjs_wifi_dpp_session_create(&options.config,
        options.allow_ap_channel_change, options.timeout_ms, &session);
    esp32_mquickjs_wireless_secure_zero(&options, sizeof(options));
    if (error != ESP_OK) { (void)dpp_error(ctx, "wifi.dpp.startEnrollee", session, error, false); goto fail; }
    *result = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_DPP_SESSION);
    if (JS_IsException(*result)) goto fail;
    JS_SetOpaque(ctx, *result, session);
    error = esp32_mquickjs_wifi_dpp_session_activate(session);
    if (error != ESP_OK) {
        JS_SetOpaque(ctx, *result, NULL);
        (void)dpp_error(ctx, "wifi.dpp.startEnrollee", session, error, false); goto fail;
    }
    /* No JS allocations after activation. Native worker owns all RF calls. */
    (void)esp32_mquickjs_wifi_dpp_service();
    JSValue value = JS_PopGCRef(ctx, &result_ref);
    JS_PopGCRef(ctx, &options_ref); return value;
fail:
    esp32_mquickjs_wifi_dpp_session_release(session);
    JS_PopGCRef(ctx, &result_ref); JS_PopGCRef(ctx, &options_ref); return JS_EXCEPTION;
}

static JSValue dpp_bytes(JSContext *ctx, const uint8_t *bytes, size_t length)
{
    JSGCRef ref;
    JSValue *array = JS_PushGCRef(ctx, &ref);
    *array = JS_NewArray(ctx, 0);
    if (JS_IsException(*array)) goto fail;
    for (size_t i = 0; i < length; ++i)
        if (JS_IsException(JS_SetPropertyUint32(ctx, *array, i, JS_NewInt32(ctx, bytes[i])))) goto fail;
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
static JSValue dpp_uri_to_js(JSContext *ctx, esp32_mquickjs_wifi_dpp_session_t *session)
{
    char uri[ESP32QJS_DPP_URI_MAX + 1U] = {0};
    esp_err_t error = esp32_mquickjs_wifi_dpp_session_uri(session, uri, sizeof(uri), false);
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    if (error != ESP_OK) { (void)dpp_error(ctx, "WiFiDppSession.receive", session, error, false); goto fail; }
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "type", JS_NewString(ctx, "uri"));
    SET(result, "uri", JS_NewString(ctx, uri));
    error = esp32_mquickjs_wifi_dpp_session_uri(session, NULL, 0, true);
    if (error != ESP_OK) { (void)dpp_error(ctx, "WiFiDppSession.receive", session, error, false); goto fail; }
    esp32_mquickjs_wireless_secure_zero(uri, sizeof(uri));
    return JS_PopGCRef(ctx, &ref);
fail:
    esp32_mquickjs_wireless_secure_zero(uri, sizeof(uri));
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

static JSValue dpp_configurations_to_js(JSContext *ctx, esp32_mquickjs_wifi_dpp_session_t *session)
{
    static const char *const akms[] = {"unknown", "dpp", "psk", "sae", "psk-sae", "sae-dpp", "psk-sae-dpp"};
    esp32_mquickjs_wifi_dpp_session_status_t status;
    (void)esp32_mquickjs_wifi_dpp_session_status(session, &status);
    esp_dpp_config_data_t row = {0};
    JSGCRef ref, entries_ref, entry_ref;
    JSValue *result = JS_PushGCRef(ctx, &ref), *entries = JS_PushGCRef(ctx, &entries_ref);
    JSValue *entry = JS_PushGCRef(ctx, &entry_ref);
    if (!status.configs_ready || !status.config_count || status.config_count > ESP_DPP_MAX_CONFIG_COUNT) goto invalid;
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "type", JS_NewString(ctx, "configurations"));
    *entries = JS_NewArray(ctx, 0);
    if (JS_IsException(*entries)) goto fail;
    for (unsigned i = 0; i < status.config_count; ++i) {
        esp_err_t error = esp32_mquickjs_wifi_dpp_session_config(session, i, &row);
        if (error != ESP_OK) { (void)dpp_error(ctx, "WiFiDppSession.receive", session, error, false); goto fail; }
        if (!row.ssid_len || row.ssid_len > sizeof(row.ssid) || row.password_len > sizeof(row.password) ||
            row.connector_len >= sizeof(row.connector) || row.net_access_key_len > sizeof(row.net_access_key) ||
            row.c_sign_key_len > sizeof(row.c_sign_key) || row.akm >= sizeof(akms) / sizeof(akms[0]) ||
            (row.connector_len && (row.connector[row.connector_len] || memchr(row.connector, 0, row.connector_len)))) goto invalid;
        *entry = JS_NewObject(ctx);
        if (JS_IsException(*entry)) goto fail;
        SET(entry, "index", JS_NewUint32(ctx, i));
        SET(entry, "ssidBytes", dpp_bytes(ctx, row.ssid, row.ssid_len));
        SET(entry, "passwordBytes", dpp_bytes(ctx, row.password, row.password_len));
        SET(entry, "akm", JS_NewString(ctx, akms[row.akm]));
        SET(entry, "connector", row.connector_len ? JS_NewStringLen(ctx, row.connector, row.connector_len) : JS_NULL);
        SET(entry, "netAccessKeyBytes", dpp_bytes(ctx, row.net_access_key, row.net_access_key_len));
        SET(entry, "cSignKeyBytes", dpp_bytes(ctx, row.c_sign_key, row.c_sign_key_len));
        SET(entry, "netAccessKeyExpiry", dpp_identity(ctx, row.net_access_key_expiry));
        SET(entry, "channel", JS_NewUint32(ctx, row.curr_chan));
        if (JS_IsException(JS_SetPropertyUint32(ctx, *entries, i, *entry))) goto fail;
        esp32_mquickjs_wireless_secure_zero(&row, sizeof(row));
    }
    SET(result, "configurations", *entries);
    esp_err_t error = esp32_mquickjs_wifi_dpp_session_configs_commit(session);
    if (error != ESP_OK) { (void)dpp_error(ctx, "WiFiDppSession.receive", session, error, false); goto fail; }
    JS_PopGCRef(ctx, &entry_ref); JS_PopGCRef(ctx, &entries_ref); return JS_PopGCRef(ctx, &ref);
invalid:
    JS_ThrowInternalError(ctx, "invalid native DPP configuration");
fail:
    esp32_mquickjs_wireless_secure_zero(&row, sizeof(row));
    JS_PopGCRef(ctx, &entry_ref); JS_PopGCRef(ctx, &entries_ref); JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

