99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_dpp/esp32_mquickjs_wifi_dpp.c
static const char *dpp_operation_name(dpp_operation_t operation)
{ return operation == DPP_RECEIVE ? "WiFiDppSession.receive" : operation == DPP_CONNECT ? "WiFiDppSession.connect" : "WiFiDppSession.close"; }
static void dpp_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (!state) return;
    if (state->observation_registered)
        esp32_mquickjs_wifi_dpp_session_wait_end(state->session, state->operation == DPP_CLOSE);
    esp32_mquickjs_wifi_dpp_session_release(state->session);
    esp32_mquickjs_memory_payload_free(state);
}
static bool dpp_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out, dpp_operation_t operation)
{
    *out = NULL;
    if (argc > 1) { JS_ThrowTypeError(ctx, "Dpp method expects optional timeout options"); return false; }
    esp32_mquickjs_wifi_dpp_session_t *session = dpp_receiver(ctx, self->val);
    if (!session) return false;
    if (!esp32_mquickjs_wifi_dpp_session_retain(session)) { JS_ThrowInternalError(ctx, "Dpp reference exhausted"); return false; }
    bool valid = true;
    uint32_t timeout = 1000;
    if (argc && !JS_IsUndefined(argv[0].val)) {
        static const char *const keys[] = {"timeoutMs"};
        valid = esp32_mquickjs_validate_plain_options(ctx, argv[0].val, dpp_operation_name(operation), keys, 1);
        if (valid) {
            JSGCRef ref;
            JSValue *field = JS_PushGCRef(ctx, &ref);
            *field = JS_GetPropertyStr(ctx, argv[0].val, "timeoutMs");
            valid = !JS_IsException(*field) && (JS_IsUndefined(*field) ||
                esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 3600000, &timeout));
            JS_PopGCRef(ctx, &ref);
        }
    }
    if (!valid) {
        esp32_mquickjs_wifi_dpp_session_release(session);
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid Dpp timeout options");
        return false;
    }
    esp32_mquickjs_future_driver_state_t *state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (!state) { esp32_mquickjs_wifi_dpp_session_release(session); JS_ThrowOutOfMemory(ctx); return false; }
    state->session = session; state->operation = operation; state->timeout_ms = timeout;
    if (!esp32_mquickjs_wifi_dpp_session_wait_begin(session, operation == DPP_CLOSE)) {
        dpp_destroy(state); JS_ThrowInternalError(ctx, "Dpp waiter count exhausted"); return false;
    }
    state->observation_registered = true;
    *out = state; return true;
}
static bool dpp_receive_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return dpp_capture(ctx, self, argc, argv, out, DPP_RECEIVE); }
static bool dpp_close_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return dpp_capture(ctx, self, argc, argv, out, DPP_CLOSE); }
static bool dpp_connect_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out)
{
    *out = NULL;
    uint32_t index, timeout = 30000;
    bool allow_ap_restart = false;
    esp32_mquickjs_wifi_dpp_auth_t auth = ESP32_MQUICKJS_DPP_AUTH_DEFAULT;
    if (argc < 1 || argc > 2 || !esp32_mquickjs_value_to_bounded_u32(ctx, argv[0].val, 0, ESP_DPP_MAX_CONFIG_COUNT - 1, &index))
        goto invalid;
    if (argc == 2 && !JS_IsUndefined(argv[1].val)) {
        static const char *const keys[] = {"authentication", "timeoutMs", "allowApRestart"};
        if (!esp32_mquickjs_validate_plain_options(ctx, argv[1].val, "WiFiDppSession.connect", keys, 3)) return false;
        JSGCRef ref;
        JSValue *field = JS_PushGCRef(ctx, &ref);
        *field = JS_GetPropertyStr(ctx, argv[1].val, "timeoutMs");
        bool ok = !JS_IsException(*field) && (JS_IsUndefined(*field) ||
            esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 3600000, &timeout));
        if (ok) {
            *field = JS_GetPropertyStr(ctx, argv[1].val, "authentication");
            ok = !JS_IsException(*field);
            if (ok && !JS_IsUndefined(*field)) {
                char name[16];
                ok = dpp_string(ctx, *field, name, sizeof(name));
                if (ok) {
                    if (!strcmp(name, "dpp")) auth = ESP32_MQUICKJS_DPP_AUTH_CONNECTOR;
                    else if (!strcmp(name, "wpa2-psk")) auth = ESP32_MQUICKJS_DPP_AUTH_PSK;
                    else if (!strcmp(name, "wpa3-sae")) auth = ESP32_MQUICKJS_DPP_AUTH_SAE;
                    else ok = false;
                }
            }
        }
        if (ok) {
            *field = JS_GetPropertyStr(ctx, argv[1].val, "allowApRestart");
            ok = !JS_IsException(*field) && (JS_IsUndefined(*field) || JS_IsBool(*field));
            if (ok) allow_ap_restart = *field == JS_TRUE;
        }
        JS_PopGCRef(ctx, &ref);
        if (!ok) goto invalid;
    }
    if (!dpp_capture(ctx, self, 0, NULL, out, DPP_CONNECT)) return false;
    (*out)->timeout_ms = timeout; (*out)->configuration_index = index; (*out)->authentication = auth;
    (*out)->allow_ap_restart = allow_ap_restart;
    return true;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid DPP configuration index or connection options");
    return false;
}

static bool dpp_start(JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token, esp32_mquickjs_future_driver_state_t *state)
{
    (void)runtime; (void)token;
    int64_t now = esp_timer_get_time(), duration = (int64_t)state->timeout_ms * 1000;
    if (now < 0 || now > INT64_MAX - duration) { JS_ThrowInternalError(ctx, "Dpp clock exhausted"); return false; }
    if (state->operation == DPP_CONNECT) {
        esp_err_t error = esp32_mquickjs_wifi_dpp_session_connect(state->session, state->configuration_index,
            state->authentication, state->timeout_ms, state->allow_ap_restart);
        if (error != ESP_OK) { (void)dpp_error(ctx, "WiFiDppSession.connect", state->session, error, false); return false; }
    }
    state->started = true; state->deadline_us = now + duration;
    if (state->operation == DPP_CLOSE) esp32_mquickjs_wifi_dpp_session_close(state->session, false);
    (void)esp32_mquickjs_wifi_dpp_service();
    return true;
}
static esp32_mquickjs_future_poll_t dpp_poll(esp32_mquickjs_future_driver_state_t *state)
{
    if (state->cancelled) return ESP32_MQUICKJS_FUTURE_READY;
    (void)esp32_mquickjs_wifi_dpp_service();
    esp32_mquickjs_wifi_dpp_session_status_t status;
    (void)esp32_mquickjs_wifi_dpp_session_status(state->session, &status);
    bool ready = state->operation == DPP_CLOSE ? status.retired : state->operation == DPP_CONNECT ?
        status.connected || status.error || status.closing : status.error || status.closing ||
        status.configs_consumed || ((status.uri_ready || status.configs_ready) && !status.worker_busy);
    if (!ready && state->operation == DPP_RECEIVE && esp_timer_get_time() >= state->deadline_us) {
        state->wait_timed_out = true; ready = true;
    }
    return ready ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
}
static JSValue dpp_finish(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->operation == DPP_CLOSE) return JS_UNDEFINED;
    if (state->wait_timed_out) return JS_NULL;
    esp32_mquickjs_wifi_dpp_session_status_t status;
    (void)esp32_mquickjs_wifi_dpp_session_status(state->session, &status);
    if (status.error || status.closing) return dpp_error(ctx, dpp_operation_name(state->operation), state->session, ESP_OK, false);
    if (state->operation == DPP_CONNECT) {
        esp32_mquickjs_wifi_link_snapshot_t link;
        double elapsed;
        esp_err_t error = esp32_mquickjs_wifi_dpp_session_connection_result(state->session, &link, &elapsed);
        if (error != ESP_OK) return dpp_error(ctx, "WiFiDppSession.connect", state->session, error, false);
        JSGCRef ref;
        JSValue *result = JS_PushGCRef(ctx, &ref);
        *result = esp32_mquickjs_wifi_make_connect_result(ctx, &link, elapsed);
        if (JS_IsException(*result) ||
            !esp32_mquickjs_set_property_ref(ctx, result, "configurationIndex", JS_NewUint32(ctx, status.configuration_index)) ||
            !esp32_mquickjs_set_property_ref(ctx, result, "connectionGeneration", JS_NewUint32(ctx, status.connection_generation)) ||
            !esp32_mquickjs_set_property_ref(ctx, result, "authentication", JS_NewString(ctx,
                status.authentication == ESP32_MQUICKJS_DPP_AUTH_CONNECTOR ? "dpp" :
                status.authentication == ESP32_MQUICKJS_DPP_AUTH_SAE ? "wpa3-sae" : "wpa2-psk"))) {
            JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
        }
        return JS_PopGCRef(ctx, &ref);
    }
    if (status.uri_ready && !status.uri_consumed) return dpp_uri_to_js(ctx, state->session);
    if (status.configs_consumed) return JS_ThrowReferenceError(ctx, "DPP configurations already consumed");
    return dpp_configurations_to_js(ctx, state->session);
}
static esp32_mquickjs_cancel_result_t dpp_cancel(esp32_mquickjs_future_driver_state_t *state)
{
    state->cancelled = true;
    if (state->operation == DPP_CONNECT && state->started) esp32_mquickjs_wifi_dpp_session_close(state->session, false);
    /* receive cancellation changes no native intent. Started close is already
     * retained by the registry; cancellation before start must not close. */
    return ESP32_MQUICKJS_CANCELLED;
}
static uint32_t dpp_timeout(const esp32_mquickjs_future_driver_state_t *state)
{ return state->operation == DPP_CLOSE ? state->timeout_ms : 0U; }
static JSValue dpp_on_timeout(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state, uint32_t timeout_ms)
{
    (void)timeout_ms;
    if (state->operation == DPP_CONNECT && state->started) esp32_mquickjs_wifi_dpp_session_close(state->session, true);
    (void)dpp_cancel(state);
    return dpp_error(ctx, dpp_operation_name(state->operation), state->session, ESP_ERR_TIMEOUT, true);
}
#define DPP_DRIVER(capture_fn) { .memory_owner = "wireless.future", .capture = capture_fn, .start = dpp_start, .poll = dpp_poll, .finish = dpp_finish, \
    .cancel = dpp_cancel, .destroy = dpp_destroy, .timeout_ms = dpp_timeout, .on_timeout = dpp_on_timeout }
static const esp32_mquickjs_future_driver_t s_dpp_receive_driver = DPP_DRIVER(dpp_receive_capture);
static const esp32_mquickjs_future_driver_t s_dpp_close_driver = DPP_DRIVER(dpp_close_capture);
static const esp32_mquickjs_future_driver_t s_dpp_connect_driver = DPP_DRIVER(dpp_connect_capture);
static JSValue dpp_call(JSContext *ctx, JSValue *receiver, int argc, JSValue *argv, const char *name)
{
    JSGCRef self_ref, method_ref;
    JSValue *self = JS_PushGCRef(ctx, &self_ref), *method = JS_PushGCRef(ctx, &method_ref);
    *self = *receiver; *method = JS_GetPropertyStr(ctx, *self, name);
    JSValue result = JS_IsException(*method) ? JS_EXCEPTION : esp32_mquickjs_future_call_and_wait(ctx,
        esp32_mquickjs_get_active_runtime(), *method, *self, argc, argv);
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &self_ref); return result;
}
JSValue js_wifi_dpp_recover(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "DPP recover expects no arguments");
    esp32_mquickjs_wifi_dpp_session_t *session = dpp_receiver(ctx, *self);
    if (!session) return JS_EXCEPTION;
    esp_err_t error = esp32_mquickjs_wifi_dpp_session_recover(session);
    if (error != ESP_OK) return dpp_error(ctx, "WiFiDppSession.recover", session, error, false);
    (void)esp32_mquickjs_wifi_dpp_service();
    return JS_UNDEFINED;
}
JSValue js_wifi_dpp_cancel(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "DPP cancel expects no arguments");
    esp32_mquickjs_wifi_dpp_session_t *session = dpp_receiver(ctx, *self);
    if (!session) return JS_EXCEPTION;
    esp32_mquickjs_wifi_dpp_session_close(session, false);
    (void)esp32_mquickjs_wifi_dpp_service();
    return JS_UNDEFINED;
}
JSValue js_wifi_dpp_receive(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return dpp_call(ctx, self, argc, argv, "receive"); }
JSValue js_wifi_dpp_connect(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return dpp_call(ctx, self, argc, argv, "connect"); }
JSValue js_wifi_dpp_close(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return dpp_call(ctx, self, argc, argv, "close"); }
bool esp32_mquickjs_init_wifi_dpp_runtime(JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref, object_ref, proto_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *proto = JS_PushGCRef(ctx, &proto_ref), *method = JS_PushGCRef(ctx, &method_ref);
    bool ok = false;
    *global = JS_GetGlobalObject(ctx);
    if (JS_IsException(*global)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "WiFiDppSession");
    if (JS_IsException(*object)) goto done;
    *proto = JS_GetPropertyStr(ctx, *object, "prototype");
    if (JS_IsException(*proto)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "receive");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_dpp_receive_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "connect");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_dpp_connect_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "close");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_dpp_close_driver)) goto done;
    ok = true;
done:
    if (!ok && !JS_HasException(ctx)) JS_ThrowInternalError(ctx, "failed to register Dpp runtime");
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &proto_ref); JS_PopGCRef(ctx, &object_ref); JS_PopGCRef(ctx, &global_ref);
    return ok;
}
#endif
